# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [2]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  6  3  7  3  9
1  4  4  1  4  8
2  1  1  8  6  6
3  1  5  8  5  1
4  4  1  2  5  3

In [3]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [4]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        6        3        7        3        9
1        4        4        1        4        8
2        1        1        8        6        6
3        1        5        8        5        1
4        4        1        2        5        3

In [5]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        6        3        7        3        9
1        4        4        1        4        8
2        1        1        8        6        6
3        1        5        8        5        1
4        4        1        2        5        3

## #02: Pemilihan baris (rows selection) pada data frame

In [6]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  2  1  3  1
1  3  3  2  2  4
2  1  4  4  1  4
3  3  2  3  2  4
4  4  1  3  2  4
5  4  4  1  2  2
6  2  4  3  1  2
7  1  3  4  3  2
8  3  1  3  3  3
9  3  2  1  3  4

In [7]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
0  3  2  1  3  1
1  3  3  2  2  4
2  1  4  4  1  4
3  3  2  3  2  4
7  1  3  4  3  2
8  3  1  3  3  3
9  3  2  1  3  4

In [8]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  3  2  1  3  1
1  3  3  2  2  4
2  1  4  4  1  4
3  3  2  3  2  4
7  1  3  4  3  2
8  3  1  3  3  3
9  3  2  1  3  4

In [9]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
4  4  1  3  2  4
5  4  4  1  2  2
6  2  4  3  1  2

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [10]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [11]:
df.dtypes

col1    object
col2    object
dtype: object

In [12]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [13]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [14]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [15]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

C:\Users\yulio\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         19.0         14    A
1 2000-01-01 01:00:00          3.0         14    B
2 2000-01-01 02:00:00          1.0          6    C
3 2000-01-01 03:00:00         12.0         13    D
4 2000-01-01 04:00:00         14.0          9    E

In [16]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [17]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         19.0         14
1          3.0         14
2          1.0          6
3         12.0         13
4         14.0          9

In [18]:
df.select_dtypes(include='float')

   bil_pecahan
0         19.0
1          3.0
2          1.0
3         12.0
4         14.0

In [19]:
df.select_dtypes(include='int')

   bil_bulat
0         14
1         14
2          6
3         13
4          9

In [20]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [21]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [22]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0         19.0         14    A
1          3.0         14    B
2          1.0          6    C
3         12.0         13    D
4         14.0          9    E

## #05: Membalik urutan baris dan kolom pada data frame

In [23]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  4  1  5  8  1
1  1  1  2  7  1
2  2  8  6  4  8
3  1  7  5  1  3
4  5  4  2  9  4

In [24]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  1  8  5  1  4
1  1  7  2  1  1
2  8  4  6  8  2
3  3  1  5  7  1
4  4  9  2  4  5

In [25]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  5  4  2  9  4
3  1  7  5  1  3
2  2  8  6  4  8
1  1  1  2  7  1
0  4  1  5  8  1

In [26]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  5  4  2  9  4
1  1  7  5  1  3
2  2  8  6  4  8
3  1  1  2  7  1
4  4  1  5  8  1

## #06: Mengganti nama (label0 kolom pada data frame

In [27]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  3  2  8  6  9
1  1  3  8  9  2
2  9  2  6  2  2
3  8  8  8  1  1
4  9  6  6  1  4

In [28]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  3  2     8  6  9
1  1  3     8  9  2
2  9  2     6  2  2
3  8  8     8  1  1
4  9  6     6  1  4

In [29]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     3       2  8     6  9
1     1       3  8     9  2
2     9       2  6     2  2
3     8       8  8     1  1
4     9       6  6     1  4

## #07: Menghapus missing values pada data frame (NaN)

In [30]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index() #formula untuk bikin dummy data dengan missing values
df.head()

        index         A         B         C         D
0  A5qmNoh469  1.827878 -0.859135 -0.215824  0.584543
1  PheSDwhSPJ  1.505236 -0.407552 -0.930933 -0.868545
2  8wy55nkASy -0.296652 -1.481889 -0.954875 -2.230543
3  HtamjPmlkc  0.745928 -0.501475 -0.054997  1.107530
4  PghrWRp0se  0.064737 -0.627623  0.630138  1.931398

In [31]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  A5qmNoh469  1.827878 -0.859135 -0.215824  0.584543
1  PheSDwhSPJ  1.505236 -0.407552 -0.930933 -0.868545
2  8wy55nkASy -0.296652 -1.481889 -0.954875 -2.230543
3  HtamjPmlkc  0.745928 -0.501475 -0.054997  1.107530
4  PghrWRp0se  0.064737 -0.627623  0.630138  1.931398

In [32]:
df_backup = df.copy(deep=True)

In [33]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  A5qmNoh469
1  PheSDwhSPJ
2  8wy55nkASy
3  HtamjPmlkc
4  PghrWRp0se

In [34]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  A5qmNoh469  1.827878 -0.859135 -0.215824  0.584543
1  PheSDwhSPJ  1.505236 -0.407552 -0.930933 -0.868545
2  8wy55nkASy -0.296652 -1.481889 -0.954875 -2.230543
3  HtamjPmlkc  0.745928 -0.501475 -0.054997  1.107530
4  PghrWRp0se  0.064737 -0.627623  0.630138  1.931398

In [35]:
# Persentase missing values untuk tiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.033333
B    0.233333
C    0.066667
D    0.066667
dtype: float64

In [36]:
# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan treshold / ambang batas (presentase missing value)
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         C         D
0  A5qmNoh469  1.827878 -0.215824  0.584543
1  PheSDwhSPJ  1.505236 -0.930933 -0.868545
2  8wy55nkASy -0.296652 -0.954875 -2.230543
3  HtamjPmlkc  0.745928 -0.054997  1.107530
4  PghrWRp0se  0.064737  0.630138  1.931398

## #08: Memeriksa kesamaan antar kolom (series) pada data frame

In [37]:
# Persiapan data frame
data  = {'A':[15, 15, 18, np.nan, 12],'B':[15, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [38]:
# Mengenal pandas series
# data frame merupakan kumpulan dari data series
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [39]:
type(df['A'])

pandas.core.series.Series

In [40]:
type(df)

pandas.core.frame.DataFrame

In [41]:
# Memeriksa kesamaan dengan operator == (Tidak di rekomendasikan karena apabila dalam data teradap NaN maka akan tidak terbaca dengan baik)
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [42]:
# Memeriksa kesamaan dengan method equals() | Lebih di rekomendasikan
df['A'].equals(df['B'])

True

In [43]:
# Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)
df.equals(df1)

True

In [44]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## #09: Membagi data frame menjadi dua secara acak

In [45]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   6   1  17  16  19
1   4   1  15   7   6
2   8  10   4   7  11
3   2  11   7   2  15
4   4  10  18  14  18
5   3  17  11  10   5
6   6   7  11   9  16
7   6  14  16  11   6
8  12  11  12  19  15
9  11  18   8  16  18

In [46]:
# Membagi dua data frame menjadi dua secara acak berdasarkan proporsi tertentu
df.shape

(10, 5)

In [47]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 Shape: {df_1.shape}')
print(f'df_2 Shape: {df_2.shape}')

df_1 Shape: (7, 5)
df_2 Shape: (3, 5)

In [48]:
df_1

    A   B   C   D   E
3   2  11   7   2  15
4   4  10  18  14  18
6   6   7  11   9  16
9  11  18   8  16  18
7   6  14  16  11   6
2   8  10   4   7  11
0   6   1  17  16  19

In [49]:
df_2

    A   B   C   D   E
1   4   1  15   7   6
5   3  17  11  10   5
8  12  11  12  19  15

## #10: Mengganti nama (label) kolom pada data frame berdasarkan pola

In [50]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.columns = ['Pclass','Survival status','full Name','Sex ',' Age','Sib SP', 'parch','Ticket','Fare','Cabin','Embarked']
df_backup = df.copy(deep=True)
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [51]:
# Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _
df.columns = df.columns.str.replace(' ','_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [52]:
# Memangkas kelebihan spasi pada nama kolom
df = df_backup.copy(deep=True)
df.columns = df.columns.str.lower().str.strip().str.replace(' ','_') 
# Remark:
# str.lower() = merubah menjadi huruf kecil
# str.strip() = menghilangkan kelebihan sepasi di awal ataupun diakhir kata
# str.replace() = mengganti huruf
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## #11: Seleksi kolom dan baris pada data frame menggunakan loc

In [53]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df

    A   B   C   D   E
0   1  16   7  13  19
1  14   4   2  17  12
2   4  17   4   5   4
3   1   7   9  17   5
4   1  11  11  19  19
5   5   4   7  11   4
6  19  15   3  12   4
7  11   8  13  19   8
8   5  13  16  17   7
9   6  12   8  16   5

In [54]:
# Seleksi kolom dan baris menggunakan loc
df.loc[[0,3,4],['B','E']] #bagian pertama untuk baris, bagian kedua untuk kolom

    B   E
0  16  19
3   7   5
4  11  19

In [55]:
# Seleksi baris dengan kondisi
df.loc[df['B']>10,['B','D','E']]

    B   D   E
0  16  13  19
2  17   5   4
4  11  19  19
6  15  12   4
8  13  17   7
9  12  16   5

In [56]:
# Slicing data frame dengan loc
df.loc[0:4, 'B':'D'] #slicing pada loc dataframe start dan End index sifatnya inclusif artinya angka tersebut di turut sertakan | Slicing list hanya start index say inclusive

    B   C   D
0  16   7  13
1   4   2  17
2  17   4   5
3   7   9  17
4  11  11  19

## #12: Membentuk kolom bertipe datetime dari beberapa kolom lain pada pandas data frame

In [57]:
# Persiapan data frame
data = {'day':[1,2,10,25,12], 'month':[1,2,4,5,6], 'year':[2000,2001,2010,2015,2020]} #data dictionary
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [58]:
# Membentuk kolom bertipe datetime
df['penanggalan'] = pd.to_datetime(df[['day','month','year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [59]:
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object

## #13: Konversi nilai numerik ke dalam kategori pada data frame

In [60]:
# Persiapan data frame
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows,n_cols)),columns=cols)
df

   usia
0    81
1     2
2    26
3    46
4    36
5    75
6    62
7    88
8    43
9    21

In [61]:
# Pengelompokan nilai numerik ke dalam beberapa kategori menggunakan cut()
df['kelompok_usia'] = pd.cut(df['usia'], bins=[0,18,65,99], labels=['anak','dewasa','manula'])
df

   usia kelompok_usia
0    81        manula
1     2          anak
2    26        dewasa
3    46        dewasa
4    36        dewasa
5    75        manula
6    62        dewasa
7    88        manula
8    43        dewasa
9    21        dewasa

## #14: Menggabungkan (merge) dua pandas data frame

In [62]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df.head()

    A   B   C   D   E
0   5  19  18  18  12
1  10   3   2   4  14
2   7  11  10   9  11
3  12   1  18   8  13
4   4  19   6  19  18

In [63]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B   C   D   E
0   5  19  18  18  12
2   7  11  10   9  11
3  12   1  18   8  13

In [64]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B   C   D   E
1  10   3   2   4  14
2   7  11  10   9  11
4   4  19   6  19  18

In [65]:
# MEnggabungkan dua data frame
df_inner = pd.merge(df1, df2, how='inner')
df_inner #Menghasilkan index baru

   A   B   C  D   E
0  7  11  10  9  11

In [66]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer # nilai duplikasi akan di hilangkan, mostly used in actual case

    A   B   C   D   E
0   5  19  18  18  12
1   7  11  10   9  11
2  12   1  18   8  13
3  10   3   2   4  14
4   4  19   6  19  18

## #15: Memecah nilai string suatu kolom ke dalam beberapa kolom baru pada pandas data frame

In [67]:
# Persiapan data frame
data = {'nama':['Didi Kempot', 'Glen Fredly','Mbah Surip'], 'tempat_kelahiran':['Surakarta, jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

          nama        tempat_kelahiran
0  Didi Kempot  Surakarta, jawa Tengah
1  Glen Fredly    Jakarta, DKI Jakarta
2   Mbah Surip   Mojokerto, Jawa Timur

In [68]:
# Memecah nama depan dan nama belakang
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

          nama        tempat_kelahiran nama_depan nama_belakang
0  Didi Kempot  Surakarta, jawa Tengah       Didi        Kempot
1  Glen Fredly    Jakarta, DKI Jakarta       Glen        Fredly
2   Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [69]:
# Memecah nama kota dan propinsi
df[['kota','propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, jawa Tengah",Didi,Kempot,Surakarta,jawa Tengah
1,Glen Fredly,"Jakarta, DKI Jakarta",Glen,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

## #16: Menata ulang data frame dengan multiple indexes menggunakan unstack()

In [70]:
# Persiapan data frame
df = pd.read_csv('./Dataset/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [71]:
# Data frame dengan multiple indexes dari hasil gouping
df.groupby(['sex','pclass'])['survived'].mean().to_frame() #to_frame() digunakan untuk mempercantik tampilan dalam hal ini tabel

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

In [72]:
# Menata ulang data frame dengan multiple indexes
df.groupby(['sex','pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

## #17: Resampling pada data deret waktu (time series data)

In [73]:
# Persiapan data frame
n_rows = 365*24 #365 = 365 hari atau 1 tahun | 24 = 24 jam atau 1 hari
n_cols = 2
cols = ['col1','col2']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)), columns=cols)
df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')  #deret waktu dalam jam
df

                     col1  col2
2000-01-01 00:00:00    16     7
2000-01-01 01:00:00    18     4
2000-01-01 02:00:00     9     7
2000-01-01 03:00:00    10    11
2000-01-01 04:00:00     2    19
...                   ...   ...
2000-12-30 19:00:00     8     6
2000-12-30 20:00:00    10     7
2000-12-30 21:00:00    13     9
2000-12-30 22:00:00    10     7
2000-12-30 23:00:00     8    11

[8760 rows x 2 columns]

In [74]:
# Resampling data dengan interval monthly
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7579
2000-02-29  6852
2000-03-31  7549
2000-04-30  7452
2000-05-31  7543
2000-06-30  7320
2000-07-31  7622
2000-08-31  7479
2000-09-30  7062
2000-10-31  7342
2000-11-30  7244
2000-12-31  6997

In [75]:
# Resampling data dengan interval daily
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   261
2000-01-02   225
2000-01-03   237
2000-01-04   263
2000-01-05   317
...          ...
2000-12-26   225
2000-12-27   274
2000-12-28   248
2000-12-29   184
2000-12-30   217

[365 rows x 1 columns]

## #18: Membentuk dummy data frame

In [76]:
# Membentuk data frame dari dictionary
pd.DataFrame({'col1':[1,2,3,4],'col2':[5,6,7,8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [77]:
# Membentuk data frame dari numpy array
n_rows = 5
n_cols = 3

arr = np.random.randint(1,20,size=(n_rows,n_cols))
arr

array([[15,  6,  7],
       [15,  1,  9],
       [ 9,  7,  1],
       [15,  6, 11],
       [15, 10, 10]])

In [78]:
pd.DataFrame(arr,columns=tuple('ABC'))

    A   B   C
0  15   6   7
1  15   1   9
2   9   7   1
3  15   6  11
4  15  10  10

In [79]:
# Membentuk data frame dengan memanfaatkan pandas.util.testing
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
xEQ9K7Oc3S  1.829895  0.702097  0.354185  0.432661
Kq8JQezIBr  1.243887 -1.453803 -1.947803  1.498163
AK4S3ShsrD -2.002517  0.057002  0.660869 -0.760427
k1sS2WspnK  0.116046 -1.631187 -0.825459  1.788939
6qSEdRkwES -0.503469 -1.327868  0.339906 -0.476175

In [80]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [81]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  1.482352  0.072163 -0.917878 -0.528963
2000-01-04  0.094705 -0.931688 -0.294962 -0.531131
2000-01-05 -0.443773 -0.328869  0.132431  0.245830
2000-01-06  1.487999  1.834710  1.065099 -0.570180
2000-01-07  1.186879 -1.065696 -0.842759 -0.637610

In [82]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
JDJpOsErH6 -0.819771  0.407766 -0.361920  1.043104
uagWVIHOC0  0.991780 -0.474141  0.642079  1.134704
lYZ12sghif  0.153886  1.649462  0.003901 -0.284563
AqJz0ddoG2  1.053277 -0.209587  1.295850  0.692531
jF95Kt7V9h       NaN -3.235151  0.245397  0.846729

## #19: